rails-with-webpacker/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('duc', '2020-05-16 14:21:33.462105', '2020-05-16 14:21:33.462105')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `users`.`updated_at` = '2020-05-16 14:26:25.781007' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)